vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA166_DFP.pdsc
    <condition id='allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXA166.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dc-fb-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='display-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='ssd1963'/>
      <require condition='device.MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.display-adv7535.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='allOf.driver.display-common, driver.video-i2c, device=MCXA166.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='display-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='video-i2c'/>
      <require condition='device.MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.display-common.condition_id'>
      <require condition='allOf.driver.video-common, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.display-it6161.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.display-it6263.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.display-sn65dsi83.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.edma4.condition_id'>
      <require condition='allOf.driver.edma_soc, device_id=MCXA166.internal_condition'/>
    </condition>
    <condition id='allOf.driver.edma_soc, device_id=MCXA166.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='edma_soc'/>
      <require condition='device_id.MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.edma_soc.condition_id'>
      <require condition='allOf.device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.eim.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.ektf2k.condition_id'>
      <require condition='allOf.device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.eqdc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.erm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.flexcan.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.flexcan_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma4, driver.flexcan, driver.edma4, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma4, driver.flexcan, driver.edma4, device=MCXA166.internal_condition'>
      <require condition='anyOf.driver.edma4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='edma'/>
      <require condition='device.MCXA166.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.edma4.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='edma'/>
    </condition>
    <condition id='driver.ft3267.condition_id'>
      <require condition='allOf.device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.ft5406.condition_id'>
      <require condition='allOf.device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.ft5406_rt.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, device=MCXA166.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require condition='device.MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.ft6x06.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.I2C, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.I2C, device=MCXA166.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='I2C' Capiversion='2.4.0'/>
      <require condition='device.MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.fxas21002cq.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.fxls8974cf.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.fxos8700cq.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.glikey.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.gpio.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.gt911.condition_id'>
      <require condition='allOf.device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.htu21d.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA166.internal_condition'/>
    </condition>
    <condition id='driver.icm42688p.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MCXA166.internal_condition'/>
    </condition>
